In [2]:
import csv
import pandas as pd

In [5]:
toxicity_worker_demographics = pd.read_csv("toxicity_worker_demographics.tsv", sep='\t')

In [6]:
toxicity_worker_demographics

      worker_id  gender  english_first_language age_group  education
0            85  female                       0     18-30  bachelors
1          1617  female                       0     45-60  bachelors
2          1394  female                       0       NaN  bachelors
3           311    male                       0     30-45  bachelors
4          1980    male                       0     45-60    masters
...         ...     ...                     ...       ...        ...
3586       3189  female                       0     18-30  bachelors
3587       1105  female                       0     18-30  bachelors
3588       2192  female                       1  Under 18         hs
3589       2692  female                       0     30-45         hs
3590       4160    male                       0     45-60  bachelors

[3591 rows x 5 columns]

In [8]:
toxicity_worker_demographics.groupby('age_group').agg('count')

           worker_id  gender  english_first_language  education
age_group
18-30           1862    1862                    1862       1862
30-45           1247    1247                    1247       1247
45-60            296     296                     296        296
Over 60           30      30                      30         30
Under 18          79      79                      79         79

In [11]:
toxicity_worker_demographics.groupby('age_group').agg('count')/toxicity_worker_demographics.count()*100

           age_group  education  english_first_language     gender  worker_id
age_group
18-30            NaN  51.851852               51.851852  51.851852  51.851852
30-45            NaN  34.725703               34.725703  34.725703  34.725703
45-60            NaN   8.242829                8.242829   8.242829   8.242829
Over 60          NaN   0.835422                0.835422   0.835422   0.835422
Under 18         NaN   2.199944                2.199944   2.199944   2.199944

In [12]:
toxicity_worker_demographics.groupby('gender').agg('count')/toxicity_worker_demographics.count()*100

        age_group  education  english_first_language  gender  worker_id
gender
female  35.116676  35.171261               35.171261     NaN  35.171261
male    64.854866  64.800891               64.800891     NaN  64.800891
other    0.028458   0.027847                0.027847     NaN   0.027847

In [13]:
toxicity_worker_demographics.groupby('education').agg('count')/toxicity_worker_demographics.count()*100

,age_group,education,english_first_language,gender,worker_id
education,,,,,
bachelors,40.153671,NaN,40.128098,40.128098,40.128098
doctorate,1.138304,NaN,1.141743,1.141743,1.141743
hs,28.457598,NaN,28.571429,28.571429,28.571429
masters,15.139442,NaN,15.204678,15.204678,15.204678
none,0.085373,NaN,0.083542,0.083542,0.083542
professional,12.435970,NaN,12.280702,12.280702,12.280702
some,2.589641,NaN,2.589808,2.589808,2.589808

In [14]:
toxicity_worker_demographics.groupby('english_first_language').agg('count')/toxicity_worker_demographics.count()*100

,age_group,education,english_first_language,gender,worker_id
english_first_language,,,,,
0,81.587934,81.453634,NaN,81.453634,81.453634
1,18.412066,18.546366,NaN,18.546366,18.546366